bolknote/MK61S_MINI/code/tools.cpp
#include <Arduino.h>
#include "bounded_string.hpp"
#include "config.h"
#if MK61_USE_ARDUINO_EEPROM_FALLBACK
  #include "EEPROM.h"
#endif
#include "lcd_gui.hpp"
#include "tools.hpp"
#include "development.hpp"
#include "focal.hpp"
#include "program_store.hpp"
#include "m61_text.hpp"
#include "shared_scratch.hpp"
#include "settings_journal.hpp"
#include "storage_path.hpp"
#include "runtime_safety.hpp"
#include "mk61emu_core.h"
#include "keyboard.h"
#include "cross_hal.h"
#include "sound_driver.hpp"
#include "tinybasic.hpp"
#ifdef SPI_FLASH
  #include <SPI.h>
  #include "spi_nor_flash.hpp"
#endif
#include "menu.hpp"
#include "debug.h"
#include "dfu_splash.hpp"

#include "ledcontrol.h"
#include <string.h>
using namespace led;

extern void reset_ext_program_state(void);

const  class_LCD_Label  STORE_message(0, 0);
const  class_LCD_Label  STORE_progress_message(0, 1);

static constexpr u8 MK61_STORE_REGISTER_F = 0x4F;
static constexpr u8 MK61_LOAD_REGISTER_F  = 0x6F;
static_assert(shared_scratch::SIZE >= program_store::MAX_MK61_TEXT_SIZE, "shared scratch too small for MK61 scripts");

static const SoundNote STARTUP_JINGLE[] = {
  {392, 120, 25, 25},
  {523, 120, 25, 25},
  {587, 120, 25, 25},
  {659, 240, 0, 25},
};

bool ResolveStoredFile(u16 cwd, const char* args,
                       program_store::Entry& entry) {
  return storage_path::resolve_file(cwd, args, entry) ==
         storage_path::Status::OK;
}

bool ResolveStoredFile(const char* args, program_store::Entry& entry) {
  return ResolveStoredFile(program_store::ROOT_ID, args, entry);
}

// Единая точка запуска сохранённого файла: используется терминалом,
// m61-сценариями и проводником. МК61-скрипты уходят в m61_text::open_program,
// который сам решает — вложенный вызов (изнутри сценария) или свежая загрузка.
bool OpenStoredEntry(const program_store::Entry& entry) {
  switch(entry.type) {
    case program_store::ProgramType::MK61:
      return m61_text::open_program(entry.id);
#if MK61_ENABLE_FOCAL
    case program_store::ProgramType::FOCAL:
      return FocalRunSucceeded(RunFocalProgram(entry.id));
#endif
#if MK61_ENABLE_TINYBASIC
    case program_store::ProgramType::TINYBASIC:
      return RunTinyBasicProgram(entry.id);
#endif
    case program_store::ProgramType::TEXT:
    case program_store::ProgramType::MK61_STATE:
      return program_store_view_entry(entry);
    case program_store::ProgramType::FONT:
      return program_store_apply_font(entry);
  }
  return false;
}

bool OpenStoredFile(const char* args) {
  return OpenStoredFile(program_store::ROOT_ID, args);
}

bool OpenStoredFile(u16 cwd, const char* args) {
  program_store::Entry entry;
  if(!ResolveStoredFile(cwd, args, entry)) return false;
  return OpenStoredEntry(entry);
}

static const SoundNote* sound_sequence = NULL;
static usize sound_sequence_len = 0;
static usize sound_sequence_index = 0;
static usize sound_sequence_pin = PIN_BUZZER;
static t_time_ms sound_sequence_next_at = 0;

static void sound_sequence_cancel(void) {
  sound_sequence = NULL;
  sound_sequence_len = 0;
  sound_sequence_index = 0;
}

static void sound_sequence_start(const SoundNote* sequence, usize len, usize pin) {
  if(sequence == NULL || len == 0) {
    sound_sequence_cancel();
    return;
  }
  sound_sequence = sequence;
  sound_sequence_len = len;
  sound_sequence_index = 0;
  sound_sequence_pin = pin;
  sound_sequence_next_at = millis();
}

static void sound_sequence_poll(void) {
  const t_time_ms now = millis();
  if(sound_sequence == NULL || (i32) (now - sound_sequence_next_at) < 0) {
    return;
  }

  if(sound_sequence_index >= sound_sequence_len) {
    sound_sequence_cancel();
    return;
  }

  const SoundNote note = sound_sequence[sound_sequence_index++];
  const usize volume = library_mk61::sound_volume();
  if(runtime_safety::valid_sound_note(note.frequency_Hz, note.duration_ms, note.volume_percent) &&
     note.frequency_Hz > 0 && volume > 0) {
    sound_driver_play_scaled(sound_sequence_pin, note.frequency_Hz, note.duration_ms, volume, note.volume_percent);
  }
  sound_sequence_next_at = now + (t_time_ms) note.duration_ms + (t_time_ms) note.gap_ms;
}

static bool opcode_needs_expanded_memory(u8 opcode) {
  return opcode == MK61_STORE_REGISTER_F || opcode == MK61_LOAD_REGISTER_F;
}

bool program_needs_expanded_memory(const u8* code_page, usize code_len) {
  const usize bounded_len = (code_len > core_61::MAX_PROGRAM_STEP) ? core_61::MAX_PROGRAM_STEP : code_len;

  for(usize i = core_61::CLASSIC_PROGRAM_STEP; i < bounded_len; i++) {
    if(code_page[i] != 0) return true;
  }

  for(usize i = 0; i < bounded_len;) {
    const u8 opcode = code_page[i];
    if(opcode_needs_expanded_memory(opcode)) return true;
    const usize opcode_len = core_61::len_code_command(opcode);
    i += (opcode_len == 0) ? 1 : opcode_len;
  }

  return false;
}

void apply_program_memory_auto(const u8* code_page, usize code_len, bool preserve_program, bool force_expanded) {
  const bool enable_expanded = force_expanded || program_needs_expanded_memory(code_page, code_len);
  if(library_mk61::expanded_program_is_on() == enable_expanded) return;

  u8 saved_code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  if(preserve_program) core_61::get_code_page(&saved_code_page[0]);

  library_mk61::set_program_memory_state(enable_expanded);
  library_mk61::refresh_menu_text();
  library_mk61::store_settings_state();
  reset_ext_program_state();
  core_61::enable();

  if(preserve_program) core_61::set_code_page(&saved_code_page[0]);
}

void ensure_program_memory_for_write(usize linear_addr, u8 opcode) {
  const bool force_expanded = linear_addr >= core_61::CLASSIC_PROGRAM_STEP || opcode_needs_expanded_memory(opcode);
  if(force_expanded) apply_program_memory_auto(NULL, 0, true, true);
}

static void Show_DFU_splash(void) {
#if defined(MK61_DISPLAY_UC1609)
  static_assert(dfu_splash::WIDTH == lcd_display::PIXEL_WIDTH,
                "DFU bitmap width must match UC1609 panel");
  static_assert(dfu_splash::HEIGHT == lcd_display::PIXEL_HEIGHT,
                "DFU bitmap height must match UC1609 panel");
  if(lcd.showFullscreenBitmap(dfu_splash::BITMAP, dfu_splash::BYTE_COUNT)) return;
#endif

  lcd.clear();
  library_mk61::print_localized_at(0, 0, "Прошивка DFU", " DFU flash mode!");
}

void DFU_enable(void) {
    void (*SysMemBootJump)(void);

    Show_DFU_splash();
    __enable_irq();
    HAL_RCC_DeInit();
    HAL_DeInit();
    SysTick->CTRL = 0; SysTick->LOAD = 0; SysTick->VAL = 0;
    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();

    const uint32_t p = (*((uint32_t *) 0x1FFF0000));
    __set_MSP( p );

    SysMemBootJump = (void (*)(void)) (*((uint32_t *) 0x1FFF0004));
    SysMemBootJump();

  while(true) {};
 
