bolknote/MK61S_MINI/code/tools.cpp
static void import_legacy_settings(void) {
  const u8 grade = read_legacy_eeprom_with_legacy(switch_R_GRD_G, legacy_switch_R_GRD_G);
  const u8 counter = read_legacy_eeprom_with_legacy(count_switch_R_GRD_G, legacy_count_switch_R_GRD_G);
  const u8 flags = read_legacy_eeprom_byte(switch_settings);
  const u8 sound = read_legacy_eeprom_byte(switch_sound_settings);

  persistent_settings.grade = grade;
  persistent_settings.counter = (counter == 0xFF) ? 0 : counter;
  persistent_settings.flags = flags;
  persistent_settings.sound = sound;
  persistent_settings.text_profile = lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS);
  persistent_settings.text_profile_stored = false;
  persistent_settings_needs_save = true;
}

static void load_persistent_settings(void) {
  if(persistent_settings_loaded) return;
  persistent_settings_loaded = true;
  const u32 settings_address = settings_flash_address();
  const u16 settings_size = settings_flash_size();
  persistent_settings_next_address = settings_address;
  persistent_settings_sector_dirty = false;
  persistent_settings_needs_save = false;
  persistent_settings_write_blocked = false;

  // Сектор настроек имеет собственный защитный маркер и остаётся пригодным,
  // когда действительный указатель C5 подключён, но оба банка файлового каталога
  // требуют восстановления.
  if(!flash_is_ok || settings_size == 0) {
    import_legacy_settings();
    return;
  }

  settings_journal::Scanner scanner(settings_size);
  while(scanner.active()) {
    u8 record[settings_journal::RECORD_SIZE];
    const u32 address = settings_address + (u32) scanner.next_offset();
    if(!flash.readByteArray(address, record, sizeof(record))) {
      // Временная ошибка чтения ни при каких условиях не должна приводить
      // к стиранию потенциально действительных настроек. В течение этой загрузки
      // продолжаем использовать значения по умолчанию и блокируем запись.
      persistent_settings_write_blocked = true;
      persistent_settings_needs_save = true;
      return;
    }
    scanner.consume(record);
  }

  if(scanner.has_value()) {
    apply_settings_record(scanner.latest());
    persistent_settings_needs_save = scanner.migration_needed();
  } else if(scanner.ended_at_erased()) {
    import_legacy_settings();
  } else {
    persistent_settings_needs_save = true;
  }

  persistent_settings_sector_dirty = scanner.needs_reclaim();
  persistent_settings_next_address = settings_address + (u32) scanner.next_offset();
  if(persistent_settings_sector_dirty) persistent_settings_needs_save = true;
}

static bool write_persistent_settings(void) {
  load_persistent_settings();
  // Если флеш-память отсутствует или чтение настроек завершилось ошибкой,
  // повторная попытка в течение этой загрузки бесполезна. Сохраняем изменённое
  // состояние ОЗУ для диагностики, но не заставляем таймер интерфейса повторять
  // попытки бесконечно.
  if(!flash_is_ok || persistent_settings_write_blocked) return true;
  if(!persistent_settings_needs_save) return true;

  const u32 settings_address = settings_flash_address();
  const u16 settings_size = settings_flash_size();
  if(settings_address == 0 || settings_size == 0) return true;
  const u32 end_address = settings_address + settings_size;
  if(persistent_settings_sector_dirty ||
     persistent_settings_next_address > end_address - settings_journal::RECORD_SIZE) {
    if(!program_store::erase_settings()) return false;
    persistent_settings_next_address = settings_address;
    persistent_settings_sector_dirty = false;
  }

  settings_journal::RecordData data = {};
  data.grade = persistent_settings.grade;
  data.counter = persistent_settings.counter;
  data.flags = persistent_settings.flags;
  data.sound = persistent_settings.sound;
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  data.text_profile_stored = persistent_settings.text_profile_stored;
  data.text_rows = persistent_settings.text_profile.rows;
  data.text_width = persistent_settings.text_profile.glyph_width;
  data.text_height = persistent_settings.text_profile.glyph_height;
  data.text_gap = persistent_settings.text_profile.line_gap;
#endif

  u8 record[settings_journal::RECORD_SIZE];
  settings_journal::encode_uncommitted(data, record);
  const u32 address = persistent_settings_next_address;
  if(!flash.writeByteArray(address, record, settings_journal::COMMIT_INDEX)) {
    persistent_settings_sector_dirty = true;
    persistent_settings_next_address = end_address;
    return false;
  }
  if(!flash.writeByte(address + settings_journal::COMMIT_INDEX, settings_journal::COMMIT_MARKER)) {
    persistent_settings_sector_dirty = true;
    persistent_settings_next_address = end_address;
    return false;
  }

  persistent_settings_next_address += settings_journal::RECORD_SIZE;
  persistent_settings_needs_save = false;
  return true;
}

AngleUnit read_stored_grade_switch(void) {
  load_persistent_settings();
  return (AngleUnit) persistent_settings.grade;
}

u8 read_counter_switch(void) {
  load_persistent_settings();
  return persistent_settings.counter;
}

SettingsFlags read_settings_flags(void) {
  load_persistent_settings();
  return normalize_settings_flags(persistent_settings.flags);
}

void store_settings_flags(SettingsFlags flags) {
  load_persistent_settings();
  flags = normalize_settings_flags(flags.raw);
  if(persistent_settings.flags != flags.raw) {
    persistent_settings.flags = flags.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

SoundSettings read_sound_settings(void) {
  load_persistent_settings();
  return normalize_sound_settings(persistent_settings.sound);
}

void store_sound_settings(SoundSettings settings) {
  load_persistent_settings();
  settings = normalize_sound_settings(settings.raw);
  if(persistent_settings.sound != settings.raw) {
    persistent_settings.sound = settings.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

bool read_display_text_profile(lcd_display::TextProfile& out) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  if(!persistent_settings.text_profile_stored) return false;

  out = lcd_display::normalizeTextProfile(persistent_settings.text_profile);
  return true;
#else
  (void) out;
  load_persistent_settings();
  return false;
#endif
}

void store_display_text_profile(lcd_display::TextProfile profile) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  profile = lcd_display::normalizeTextProfile(profile);
  const bool unchanged = persistent_settings.text_profile_stored &&
    persistent_settings.text_profile.rows == profile.rows &&
    persistent_settings.text_profile.glyph_width == profile.glyph_width &&
    persistent_settings.text_profile.glyph_height == profile.glyph_height &&
    persistent_settings.text_profile.line_gap == profile.line_gap;
  if(!unchanged) {
    persistent_settings.text_profile = profile;
    persistent_settings.text_profile_stored = true;
    persistent_settings_needs_save = true;
  }
  write_persistent_settings();
#else
  (void) profile;
#endif
}

